# Introduction To Data Analysis:

<img src="Images/data1.jpg" alt="Indexing Image" width="350"  
     style="display: block; margin-left: auto; margin-right: auto;">

## How to import csv file

In [56]:
import pandas as pd
path = "D:/tutedude/Data Analysis/CSV_Files/sample_numeric_data.csv"
df = pd.read_csv(path)
print(df)

      ID   Age  Height  Weight  Score   Salary  Multiples_4
0    1.0  23.0     165    55.0     78  35000.0          4.0
1    2.0  25.0     170    60.0     82  42000.0          8.0
2    3.0  22.0     160    50.0     75  31000.0         12.0
3    4.0  27.0     175    65.0     85  48000.0         16.0
4    5.0  24.0     168    59.0     80      NaN         20.0
5    6.0  29.0     180    70.0     90  52000.0         24.0
6    7.0  31.0     172    68.0     88  50000.0         28.0
7    8.0  26.0     169    61.0     84  43000.0         32.0
8    9.0  28.0     178    72.0     92  54000.0         36.0
9   10.0   NaN     182    75.0     95  56000.0         40.0
10  11.0  21.0     158    48.0     70  30000.0         44.0
11  12.0  23.0     162    54.0     76  34000.0         48.0
12  13.0  32.0     176     NaN     93  55000.0         52.0
13  14.0  35.0     170    69.0     87  51000.0         56.0
14  15.0  33.0     174    71.0     89  53000.0         60.0
15  16.0  26.0     168    58.0     81  40000.0         64.0
16   NaN  24.0     163     NaN     79      NaN         68.0
17  18.0  28.0     177    66.0     86  47000.0         72.0
18  19.0  27.0     173    64.0     83  44000.0          NaN
19  20.0  29.0     180    74.0     91  55000.0          NaN

## How to view the files

In [33]:
df.head(5) # It will show upto first 5 rows

   ID  Age  Height  Weight  Score  Salary
0   1   23     165      55     78   35000
1   2   25     170      60     82   42000
2   3   22     160      50     75   31000
3   4   27     175      65     85   48000
4   5   24     168      59     80   39000

In [35]:
df.tail(5) # It will show last 5 rows

    ID  Age  Height  Weight  Score  Salary
15  16   26     168      58     81   40000
16  17   24     163      55     79   36000
17  18   28     177      66     86   47000
18  19   27     173      64     83   44000
19  20   29     180      74     91   55000

In [39]:
df.dtypes # It will show each column's datatype

ID        int64
Age       int64
Height    int64
Weight    int64
Score     int64
Salary    int64
dtype: object

In [43]:
df.describe() # It will help to see statistical summary like, count, mean, std, etc.

             ID        Age      Height     Weight      Score       Salary
count  20.00000  20.000000   20.000000  20.000000  20.000000     20.00000
mean   10.50000  27.150000  171.000000  63.350000  84.200000  44750.00000
std     5.91608   3.815136    6.950956   8.235194   6.638009   8540.15284
min     1.00000  21.000000  158.000000  48.000000  70.000000  30000.00000
25%     5.75000  24.000000  167.250000  57.250000  79.750000  38250.00000
50%    10.50000  27.000000  171.000000  64.500000  84.500000  45500.00000
75%    15.25000  29.250000  176.250000  70.250000  89.250000  52250.00000
max    20.00000  35.000000  182.000000  75.000000  95.000000  56000.00000

In [45]:
# For full statistical summary,
df.describe(include="all")

             ID        Age      Height     Weight      Score       Salary
count  20.00000  20.000000   20.000000  20.000000  20.000000     20.00000
mean   10.50000  27.150000  171.000000  63.350000  84.200000  44750.00000
std     5.91608   3.815136    6.950956   8.235194   6.638009   8540.15284
min     1.00000  21.000000  158.000000  48.000000  70.000000  30000.00000
25%     5.75000  24.000000  167.250000  57.250000  79.750000  38250.00000
50%    10.50000  27.000000  171.000000  64.500000  84.500000  45500.00000
75%    15.25000  29.250000  176.250000  70.250000  89.250000  52250.00000
max    20.00000  35.000000  182.000000  75.000000  95.000000  56000.00000

In [49]:
df.info() #It will show the concise summary of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      20 non-null     int64
 1   Age     20 non-null     int64
 2   Height  20 non-null     int64
 3   Weight  20 non-null     int64
 4   Score   20 non-null     int64
 5   Salary  20 non-null     int64
dtypes: int64(6)
memory usage: 1.1 KB

In [53]:
df.columns #It will show the total columns name

Index(['ID', 'Age', 'Height', 'Weight', 'Score', 'Salary'], dtype='object')